const newsData = [
    {
        id: 1,
        type: 'آموزشی',
        imageUrl: './images/blogs/2.png',
        title: 'برنامه نویسی چیست؟‌ – همه چیز هایی که باید بدانید + کاربردها',
        caption:
            'محبوبیت برنامه نویسی در سال‌های اخیر به قدری افزایش یافته است که تقریباً اکثر افراد در مورد آن چیزهایی شنیده‌اند. با توجه به درآمد و حقوق بالای برنامه نویسی و جذابیت‌های متعدد آن...',
        star: 3.3,
        view: 22,
        isWide: false,
    },
    {
        id: 2,
        type: 'آموزشی',
        imageUrl: './images/blogs/1.png',
        title: 'برنامه نویسی چیست؟‌ – همه چیز هایی که باید بدانید + اسکریپت چیست و چه کاربردی در برنامه‌نویسی دارد؟',
        caption:
            'برنامه‌های ساده و کوتاهی که برای خودکارسازی انجام برخی از وظایف نوشته می‌شود در دنیای برنامه نویسی اسکریپت نام دارد. برخلاف برنامه‌های بزرگ و پیچیده، با این ابزار اغلب به‌سرعت نوشته و اجرا می‌شوند و نیازی به کامپایل ندارند. اسکریپت‌ها در زمینه‌های مختلفی مانند وب، سیستم‌عامل‌ها، پردازش داده‌ها یا اتوماسیون وظایف کاربردی هستند.',
        star: 3.3,
        view: 22,
        isWide: true,
    },
    {
        id: 3,
        type: 'آموزشی',
        imageUrl: './images/blogs/5.png',
        title: '10 افزونه برتر VSCode ضروری برای Pythonistas',
        caption:
            'برای توسعه دهندگان پایتون، دانشمندان داده و تحلیلگران، با استفاده از VSCode، این مجموعه برخی از افزونه ها را برای افزایش بهره وری و کارایی برنامه نویسی شما در پایتون و نیازهای برنامه نویسی ...',
        star: 3.3,
        view: 23,
        isWide: false,
    },
    {
        id: 4,
        type: 'آموزشی',
        imageUrl: './images/blogs/3.png',
        title: 'HTML چیست؟ از سیر تا پیاز HTML',
        caption:
            'در طول روز ما از سایت های زیادی بازدید می کنیم و هرکدام به شکل خاصی برای ما جالب و جذاب هستند. ممکن است که شما تا به حال یه این فکر افتاده باشید که که این وب سایت...',
        star: 3.3,
        view: 22,
        isWide: false,
    },
    {
        id: 5,
        type: 'آموزشی',
        imageUrl: './images/blogs/4.png',
        title: 'پایتون + ماینکرفت = یادگیری برنامه‌ نویسی با بازی!',
        caption:
            'پایتون یکی از محبوب‌ ترین زبان‌های برنامه‌ نویسی دنیاست؛ ساده، قابل فهم و در عین حال قدرتمند! ماینکرفت نیز یکی از پرفروش‌ ترین و خلاقانه‌‌ترین بازی‌های تاریخ است.',
        star: 3.3,
        view: 22,
        isWide: false,
    },
];
export default newsData;
